#+TITLE: HW-1
#+AUTHOR: Jason Medcoff

The bullet points given in the assignment follow as section headers.

** Computation of inverses mod n

Easy, given that the extended euclidean algo gives this to
us. However, note that the result will belong to the equivalence class
of inverses to a, and will not necessarily fall in [0, ..., p-1]. So,
we compute the result mod p so that it always falls in this range.

#+BEGIN_SRC python :session
def inverse_modp(a, p):
    """Find the inverse of a in Z/pZ, if it exists."""
    d, x, y = ext_euclidean(a, p)
    return None if d != 1 else (x % p)

inverse_modp(3, 7) # [5]
#+END_SRC

#+RESULTS:
: 5

